grevaillot/svd_tools/headers/ATSAM4S16B/tc1.h
#pragma once 

/* --- TC1: Timer Counter 1 ----------------------------------------- */

#define TC1_CCR0			MMIO32(TC1_BASE + 0x00)
#define TC1_CMR0			MMIO32(TC1_BASE + 0x04)
#define TC1_CMR0_WAVE_EQ_1			MMIO32(TC1_BASE + 0x04)
#define TC1_SMMR0			MMIO32(TC1_BASE + 0x08)
#define TC1_CV0			MMIO32(TC1_BASE + 0x10)
#define TC1_RA0			MMIO32(TC1_BASE + 0x14)
#define TC1_RB0			MMIO32(TC1_BASE + 0x18)
#define TC1_RC0			MMIO32(TC1_BASE + 0x1c)
#define TC1_SR0			MMIO32(TC1_BASE + 0x20)
#define TC1_IER0			MMIO32(TC1_BASE + 0x24)
#define TC1_IDR0			MMIO32(TC1_BASE + 0x28)
#define TC1_IMR0			MMIO32(TC1_BASE + 0x2c)
#define TC1_CCR1			MMIO32(TC1_BASE + 0x40)
#define TC1_CMR1			MMIO32(TC1_BASE + 0x44)
#define TC1_CMR1_WAVE_EQ_1			MMIO32(TC1_BASE + 0x44)
#define TC1_SMMR1			MMIO32(TC1_BASE + 0x48)
#define TC1_CV1			MMIO32(TC1_BASE + 0x50)
#define TC1_RA1			MMIO32(TC1_BASE + 0x54)
#define TC1_RB1			MMIO32(TC1_BASE + 0x58)
#define TC1_RC1			MMIO32(TC1_BASE + 0x5c)
#define TC1_SR1			MMIO32(TC1_BASE + 0x60)
#define TC1_IER1			MMIO32(TC1_BASE + 0x64)
#define TC1_IDR1			MMIO32(TC1_BASE + 0x68)
#define TC1_IMR1			MMIO32(TC1_BASE + 0x6c)
#define TC1_CCR2			MMIO32(TC1_BASE + 0x80)
#define TC1_CMR2			MMIO32(TC1_BASE + 0x84)
#define TC1_CMR2_WAVE_EQ_1			MMIO32(TC1_BASE + 0x84)
#define TC1_SMMR2			MMIO32(TC1_BASE + 0x88)
#define TC1_CV2			MMIO32(TC1_BASE + 0x90)
#define TC1_RA2			MMIO32(TC1_BASE + 0x94)
#define TC1_RB2			MMIO32(TC1_BASE + 0x98)
#define TC1_RC2			MMIO32(TC1_BASE + 0x9c)
#define TC1_SR2			MMIO32(TC1_BASE + 0xa0)
#define TC1_IER2			MMIO32(TC1_BASE + 0xa4)
#define TC1_IDR2			MMIO32(TC1_BASE + 0xa8)
#define TC1_IMR2			MMIO32(TC1_BASE + 0xac)
#define TC1_BCR			MMIO32(TC1_BASE + 0xc0)
#define TC1_BMR			MMIO32(TC1_BASE + 0xc4)
#define TC1_QIER			MMIO32(TC1_BASE + 0xc8)
#define TC1_QIDR			MMIO32(TC1_BASE + 0xcc)
#define TC1_QIMR			MMIO32(TC1_BASE + 0xd0)
#define TC1_QISR			MMIO32(TC1_BASE + 0xd4)
#define TC1_FMR			MMIO32(TC1_BASE + 0xd8)
#define TC1_WPMR			MMIO32(TC1_BASE + 0xe4)


/* --- TC1_CCR0 values ---------------------------------------------- */


/* @def TC1_CCR0_SWTRG
* @brief Software Trigger Command */
#define TC1_CCR0_SWTRG		(1 << 2)

/* @def TC1_CCR0_CLKDIS
* @brief Counter Clock Disable Command */
#define TC1_CCR0_CLKDIS		(1 << 1)

/* @def TC1_CCR0_CLKEN
* @brief Counter Clock Enable Command */
#define TC1_CCR0_CLKEN		(1 << 0)

/* --- TC1_CMR0 values ---------------------------------------------- */


/* @def TC1_CMR0_LDRB
* @brief RB Loading Edge Selection */
#define TC1_CMR0_LDRB_SHIFT		18
#define TC1_CMR0_LDRB_MASK		0x03
/** @defgroup tc1_cmr0_ldrb LDRB
* @brief RB Loading Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR0_LDRA
* @brief RA Loading Edge Selection */
#define TC1_CMR0_LDRA_SHIFT		16
#define TC1_CMR0_LDRA_MASK		0x03
/** @defgroup tc1_cmr0_ldra LDRA
* @brief RA Loading Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE
* @brief Waveform Mode */
#define TC1_CMR0_WAVE		(1 << 15)

/* @def TC1_CMR0_CPCTRG
* @brief RC Compare Trigger Enable */
#define TC1_CMR0_CPCTRG		(1 << 14)

/* @def TC1_CMR0_ABETRG
* @brief TIOA or TIOB External Trigger Selection */
#define TC1_CMR0_ABETRG		(1 << 10)

/* @def TC1_CMR0_ETRGEDG
* @brief External Trigger Edge Selection */
#define TC1_CMR0_ETRGEDG_SHIFT		8
#define TC1_CMR0_ETRGEDG_MASK		0x03
/** @defgroup tc1_cmr0_etrgedg ETRGEDG
* @brief External Trigger Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR0_LDBDIS
* @brief Counter Clock Disable with RB Loading */
#define TC1_CMR0_LDBDIS		(1 << 7)

/* @def TC1_CMR0_LDBSTOP
* @brief Counter Clock Stopped with RB Loading */
#define TC1_CMR0_LDBSTOP		(1 << 6)

/* @def TC1_CMR0_BURST
* @brief Burst Signal Selection */
#define TC1_CMR0_BURST_SHIFT		4
#define TC1_CMR0_BURST_MASK		0x03
/** @defgroup tc1_cmr0_burst BURST
* @brief Burst Signal Selection
@{*/
/*@}*/

/* @def TC1_CMR0_CLKI
* @brief Clock Invert */
#define TC1_CMR0_CLKI		(1 << 3)

/* @def TC1_CMR0_TCCLKS
* @brief Clock Selection */
#define TC1_CMR0_TCCLKS_SHIFT		0
#define TC1_CMR0_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr0_tcclks TCCLKS
* @brief Clock Selection
@{*/
/*@}*/

/* --- TC1_CMR0_WAVE_EQ_1 values ------------------------------------ */


/* @def TC1_CMR0_WAVE_EQ_1_BSWTRG
* @brief Software Trigger Effect on TIOB */
#define TC1_CMR0_WAVE_EQ_1_BSWTRG_SHIFT		30
#define TC1_CMR0_WAVE_EQ_1_BSWTRG_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_bswtrg BSWTRG
* @brief Software Trigger Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_BEEVT
* @brief External Event Effect on TIOB */
#define TC1_CMR0_WAVE_EQ_1_BEEVT_SHIFT		28
#define TC1_CMR0_WAVE_EQ_1_BEEVT_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_beevt BEEVT
* @brief External Event Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_BCPC
* @brief RC Compare Effect on TIOB */
#define TC1_CMR0_WAVE_EQ_1_BCPC_SHIFT		26
#define TC1_CMR0_WAVE_EQ_1_BCPC_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_bcpc BCPC
* @brief RC Compare Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_BCPB
* @brief RB Compare Effect on TIOB */
#define TC1_CMR0_WAVE_EQ_1_BCPB_SHIFT		24
#define TC1_CMR0_WAVE_EQ_1_BCPB_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_bcpb BCPB
* @brief RB Compare Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_ASWTRG
* @brief Software Trigger Effect on TIOA */
#define TC1_CMR0_WAVE_EQ_1_ASWTRG_SHIFT		22
#define TC1_CMR0_WAVE_EQ_1_ASWTRG_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_aswtrg ASWTRG
* @brief Software Trigger Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_AEEVT
* @brief External Event Effect on TIOA */
#define TC1_CMR0_WAVE_EQ_1_AEEVT_SHIFT		20
#define TC1_CMR0_WAVE_EQ_1_AEEVT_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_aeevt AEEVT
* @brief External Event Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_ACPC
* @brief RC Compare Effect on TIOA */
#define TC1_CMR0_WAVE_EQ_1_ACPC_SHIFT		18
#define TC1_CMR0_WAVE_EQ_1_ACPC_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_acpc ACPC
* @brief RC Compare Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_ACPA
* @brief RA Compare Effect on TIOA */
#define TC1_CMR0_WAVE_EQ_1_ACPA_SHIFT		16
#define TC1_CMR0_WAVE_EQ_1_ACPA_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_acpa ACPA
* @brief RA Compare Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_WAVE
* @brief Waveform Mode */
#define TC1_CMR0_WAVE_EQ_1_WAVE		(1 << 15)

/* @def TC1_CMR0_WAVE_EQ_1_WAVSEL
* @brief Waveform Selection */
#define TC1_CMR0_WAVE_EQ_1_WAVSEL_SHIFT		13
#define TC1_CMR0_WAVE_EQ_1_WAVSEL_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_wavsel WAVSEL
* @brief Waveform Selection
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_ENETRG
* @brief External Event Trigger Enable */
#define TC1_CMR0_WAVE_EQ_1_ENETRG		(1 << 12)

