grevaillot/svd_tools/headers/ATSAM4S16B/tc1.h
/* @def TC1_CMR0_WAVE_EQ_1_EEVT
* @brief External Event Selection */
#define TC1_CMR0_WAVE_EQ_1_EEVT_SHIFT		10
#define TC1_CMR0_WAVE_EQ_1_EEVT_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_eevt EEVT
* @brief External Event Selection
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_EEVTEDG
* @brief External Event Edge Selection */
#define TC1_CMR0_WAVE_EQ_1_EEVTEDG_SHIFT		8
#define TC1_CMR0_WAVE_EQ_1_EEVTEDG_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_eevtedg EEVTEDG
* @brief External Event Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_CPCDIS
* @brief Counter Clock Disable with RC Compare */
#define TC1_CMR0_WAVE_EQ_1_CPCDIS		(1 << 7)

/* @def TC1_CMR0_WAVE_EQ_1_CPCSTOP
* @brief Counter Clock Stopped with RC Compare */
#define TC1_CMR0_WAVE_EQ_1_CPCSTOP		(1 << 6)

/* @def TC1_CMR0_WAVE_EQ_1_BURST
* @brief Burst Signal Selection */
#define TC1_CMR0_WAVE_EQ_1_BURST_SHIFT		4
#define TC1_CMR0_WAVE_EQ_1_BURST_MASK		0x03
/** @defgroup tc1_cmr0_wave_eq_1_burst BURST
* @brief Burst Signal Selection
@{*/
/*@}*/

/* @def TC1_CMR0_WAVE_EQ_1_CLKI
* @brief Clock Invert */
#define TC1_CMR0_WAVE_EQ_1_CLKI		(1 << 3)

/* @def TC1_CMR0_WAVE_EQ_1_TCCLKS
* @brief Clock Selection */
#define TC1_CMR0_WAVE_EQ_1_TCCLKS_SHIFT		0
#define TC1_CMR0_WAVE_EQ_1_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr0_wave_eq_1_tcclks TCCLKS
* @brief Clock Selection
@{*/
/*@}*/

/* --- TC1_SMMR0 values --------------------------------------------- */


/* @def TC1_SMMR0_DOWN
* @brief DOWN Count */
#define TC1_SMMR0_DOWN		(1 << 1)

/* @def TC1_SMMR0_GCEN
* @brief Gray Count Enable */
#define TC1_SMMR0_GCEN		(1 << 0)

/* --- TC1_CV0 values ----------------------------------------------- */


/* @def TC1_CV0_CV
* @brief Counter Value */
#define TC1_CV0_CV_SHIFT		0
#define TC1_CV0_CV_MASK		0xffffffff
/** @defgroup tc1_cv0_cv CV
* @brief Counter Value
@{*/
/*@}*/

/* --- TC1_RA0 values ----------------------------------------------- */


/* @def TC1_RA0_RA
* @brief Register A */
#define TC1_RA0_RA_SHIFT		0
#define TC1_RA0_RA_MASK		0xffffffff
/** @defgroup tc1_ra0_ra RA
* @brief Register A
@{*/
/*@}*/

/* --- TC1_RB0 values ----------------------------------------------- */


/* @def TC1_RB0_RB
* @brief Register B */
#define TC1_RB0_RB_SHIFT		0
#define TC1_RB0_RB_MASK		0xffffffff
/** @defgroup tc1_rb0_rb RB
* @brief Register B
@{*/
/*@}*/

/* --- TC1_RC0 values ----------------------------------------------- */


/* @def TC1_RC0_RC
* @brief Register C */
#define TC1_RC0_RC_SHIFT		0
#define TC1_RC0_RC_MASK		0xffffffff
/** @defgroup tc1_rc0_rc RC
* @brief Register C
@{*/
/*@}*/

/* --- TC1_SR0 values ----------------------------------------------- */


/* @def TC1_SR0_MTIOB
* @brief TIOB Mirror */
#define TC1_SR0_MTIOB		(1 << 18)

/* @def TC1_SR0_MTIOA
* @brief TIOA Mirror */
#define TC1_SR0_MTIOA		(1 << 17)

/* @def TC1_SR0_CLKSTA
* @brief Clock Enabling Status */
#define TC1_SR0_CLKSTA		(1 << 16)

/* @def TC1_SR0_ETRGS
* @brief External Trigger Status */
#define TC1_SR0_ETRGS		(1 << 7)

/* @def TC1_SR0_LDRBS
* @brief RB Loading Status */
#define TC1_SR0_LDRBS		(1 << 6)

/* @def TC1_SR0_LDRAS
* @brief RA Loading Status */
#define TC1_SR0_LDRAS		(1 << 5)

/* @def TC1_SR0_CPCS
* @brief RC Compare Status */
#define TC1_SR0_CPCS		(1 << 4)

/* @def TC1_SR0_CPBS
* @brief RB Compare Status */
#define TC1_SR0_CPBS		(1 << 3)

/* @def TC1_SR0_CPAS
* @brief RA Compare Status */
#define TC1_SR0_CPAS		(1 << 2)

/* @def TC1_SR0_LOVRS
* @brief Load Overrun Status */
#define TC1_SR0_LOVRS		(1 << 1)

/* @def TC1_SR0_COVFS
* @brief Counter Overflow Status */
#define TC1_SR0_COVFS		(1 << 0)

/* --- TC1_IER0 values ---------------------------------------------- */


/* @def TC1_IER0_ETRGS
* @brief External Trigger */
#define TC1_IER0_ETRGS		(1 << 7)

/* @def TC1_IER0_LDRBS
* @brief RB Loading */
#define TC1_IER0_LDRBS		(1 << 6)

/* @def TC1_IER0_LDRAS
* @brief RA Loading */
#define TC1_IER0_LDRAS		(1 << 5)

/* @def TC1_IER0_CPCS
* @brief RC Compare */
#define TC1_IER0_CPCS		(1 << 4)

/* @def TC1_IER0_CPBS
* @brief RB Compare */
#define TC1_IER0_CPBS		(1 << 3)

/* @def TC1_IER0_CPAS
* @brief RA Compare */
#define TC1_IER0_CPAS		(1 << 2)

/* @def TC1_IER0_LOVRS
* @brief Load Overrun */
#define TC1_IER0_LOVRS		(1 << 1)

/* @def TC1_IER0_COVFS
* @brief Counter Overflow */
#define TC1_IER0_COVFS		(1 << 0)

/* --- TC1_IDR0 values ---------------------------------------------- */


/* @def TC1_IDR0_ETRGS
* @brief External Trigger */
#define TC1_IDR0_ETRGS		(1 << 7)

/* @def TC1_IDR0_LDRBS
* @brief RB Loading */
#define TC1_IDR0_LDRBS		(1 << 6)

/* @def TC1_IDR0_LDRAS
* @brief RA Loading */
#define TC1_IDR0_LDRAS		(1 << 5)

/* @def TC1_IDR0_CPCS
* @brief RC Compare */
#define TC1_IDR0_CPCS		(1 << 4)

/* @def TC1_IDR0_CPBS
* @brief RB Compare */
#define TC1_IDR0_CPBS		(1 << 3)

/* @def TC1_IDR0_CPAS
* @brief RA Compare */
#define TC1_IDR0_CPAS		(1 << 2)

/* @def TC1_IDR0_LOVRS
* @brief Load Overrun */
#define TC1_IDR0_LOVRS		(1 << 1)

/* @def TC1_IDR0_COVFS
* @brief Counter Overflow */
#define TC1_IDR0_COVFS		(1 << 0)

/* --- TC1_IMR0 values ---------------------------------------------- */


/* @def TC1_IMR0_ETRGS
* @brief External Trigger */
#define TC1_IMR0_ETRGS		(1 << 7)

/* @def TC1_IMR0_LDRBS
* @brief RB Loading */
#define TC1_IMR0_LDRBS		(1 << 6)

/* @def TC1_IMR0_LDRAS
* @brief RA Loading */
#define TC1_IMR0_LDRAS		(1 << 5)

/* @def TC1_IMR0_CPCS
* @brief RC Compare */
#define TC1_IMR0_CPCS		(1 << 4)

/* @def TC1_IMR0_CPBS
* @brief RB Compare */
#define TC1_IMR0_CPBS		(1 << 3)

/* @def TC1_IMR0_CPAS
* @brief RA Compare */
#define TC1_IMR0_CPAS		(1 << 2)

/* @def TC1_IMR0_LOVRS
* @brief Load Overrun */
#define TC1_IMR0_LOVRS		(1 << 1)

/* @def TC1_IMR0_COVFS
* @brief Counter Overflow */
#define TC1_IMR0_COVFS		(1 << 0)

/* --- TC1_CCR1 values ---------------------------------------------- */


/* @def TC1_CCR1_SWTRG
* @brief Software Trigger Command */
#define TC1_CCR1_SWTRG		(1 << 2)

/* @def TC1_CCR1_CLKDIS
* @brief Counter Clock Disable Command */
#define TC1_CCR1_CLKDIS		(1 << 1)

