grevaillot/svd_tools/headers/ATSAM4S16B/tc1.h
/* @def TC1_CCR1_CLKEN
* @brief Counter Clock Enable Command */
#define TC1_CCR1_CLKEN		(1 << 0)

/* --- TC1_CMR1 values ---------------------------------------------- */


/* @def TC1_CMR1_LDRB
* @brief RB Loading Edge Selection */
#define TC1_CMR1_LDRB_SHIFT		18
#define TC1_CMR1_LDRB_MASK		0x03
/** @defgroup tc1_cmr1_ldrb LDRB
* @brief RB Loading Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR1_LDRA
* @brief RA Loading Edge Selection */
#define TC1_CMR1_LDRA_SHIFT		16
#define TC1_CMR1_LDRA_MASK		0x03
/** @defgroup tc1_cmr1_ldra LDRA
* @brief RA Loading Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE
* @brief Waveform Mode */
#define TC1_CMR1_WAVE		(1 << 15)

/* @def TC1_CMR1_CPCTRG
* @brief RC Compare Trigger Enable */
#define TC1_CMR1_CPCTRG		(1 << 14)

/* @def TC1_CMR1_ABETRG
* @brief TIOA or TIOB External Trigger Selection */
#define TC1_CMR1_ABETRG		(1 << 10)

/* @def TC1_CMR1_ETRGEDG
* @brief External Trigger Edge Selection */
#define TC1_CMR1_ETRGEDG_SHIFT		8
#define TC1_CMR1_ETRGEDG_MASK		0x03
/** @defgroup tc1_cmr1_etrgedg ETRGEDG
* @brief External Trigger Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR1_LDBDIS
* @brief Counter Clock Disable with RB Loading */
#define TC1_CMR1_LDBDIS		(1 << 7)

/* @def TC1_CMR1_LDBSTOP
* @brief Counter Clock Stopped with RB Loading */
#define TC1_CMR1_LDBSTOP		(1 << 6)

/* @def TC1_CMR1_BURST
* @brief Burst Signal Selection */
#define TC1_CMR1_BURST_SHIFT		4
#define TC1_CMR1_BURST_MASK		0x03
/** @defgroup tc1_cmr1_burst BURST
* @brief Burst Signal Selection
@{*/
/*@}*/

/* @def TC1_CMR1_CLKI
* @brief Clock Invert */
#define TC1_CMR1_CLKI		(1 << 3)

/* @def TC1_CMR1_TCCLKS
* @brief Clock Selection */
#define TC1_CMR1_TCCLKS_SHIFT		0
#define TC1_CMR1_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr1_tcclks TCCLKS
* @brief Clock Selection
@{*/
/*@}*/

/* --- TC1_CMR1_WAVE_EQ_1 values ------------------------------------ */


/* @def TC1_CMR1_WAVE_EQ_1_BSWTRG
* @brief Software Trigger Effect on TIOB */
#define TC1_CMR1_WAVE_EQ_1_BSWTRG_SHIFT		30
#define TC1_CMR1_WAVE_EQ_1_BSWTRG_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_bswtrg BSWTRG
* @brief Software Trigger Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_BEEVT
* @brief External Event Effect on TIOB */
#define TC1_CMR1_WAVE_EQ_1_BEEVT_SHIFT		28
#define TC1_CMR1_WAVE_EQ_1_BEEVT_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_beevt BEEVT
* @brief External Event Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_BCPC
* @brief RC Compare Effect on TIOB */
#define TC1_CMR1_WAVE_EQ_1_BCPC_SHIFT		26
#define TC1_CMR1_WAVE_EQ_1_BCPC_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_bcpc BCPC
* @brief RC Compare Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_BCPB
* @brief RB Compare Effect on TIOB */
#define TC1_CMR1_WAVE_EQ_1_BCPB_SHIFT		24
#define TC1_CMR1_WAVE_EQ_1_BCPB_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_bcpb BCPB
* @brief RB Compare Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_ASWTRG
* @brief Software Trigger Effect on TIOA */
#define TC1_CMR1_WAVE_EQ_1_ASWTRG_SHIFT		22
#define TC1_CMR1_WAVE_EQ_1_ASWTRG_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_aswtrg ASWTRG
* @brief Software Trigger Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_AEEVT
* @brief External Event Effect on TIOA */
#define TC1_CMR1_WAVE_EQ_1_AEEVT_SHIFT		20
#define TC1_CMR1_WAVE_EQ_1_AEEVT_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_aeevt AEEVT
* @brief External Event Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_ACPC
* @brief RC Compare Effect on TIOA */
#define TC1_CMR1_WAVE_EQ_1_ACPC_SHIFT		18
#define TC1_CMR1_WAVE_EQ_1_ACPC_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_acpc ACPC
* @brief RC Compare Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_ACPA
* @brief RA Compare Effect on TIOA */
#define TC1_CMR1_WAVE_EQ_1_ACPA_SHIFT		16
#define TC1_CMR1_WAVE_EQ_1_ACPA_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_acpa ACPA
* @brief RA Compare Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_WAVE
* @brief Waveform Mode */
#define TC1_CMR1_WAVE_EQ_1_WAVE		(1 << 15)

/* @def TC1_CMR1_WAVE_EQ_1_WAVSEL
* @brief Waveform Selection */
#define TC1_CMR1_WAVE_EQ_1_WAVSEL_SHIFT		13
#define TC1_CMR1_WAVE_EQ_1_WAVSEL_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_wavsel WAVSEL
* @brief Waveform Selection
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_ENETRG
* @brief External Event Trigger Enable */
#define TC1_CMR1_WAVE_EQ_1_ENETRG		(1 << 12)

/* @def TC1_CMR1_WAVE_EQ_1_EEVT
* @brief External Event Selection */
#define TC1_CMR1_WAVE_EQ_1_EEVT_SHIFT		10
#define TC1_CMR1_WAVE_EQ_1_EEVT_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_eevt EEVT
* @brief External Event Selection
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_EEVTEDG
* @brief External Event Edge Selection */
#define TC1_CMR1_WAVE_EQ_1_EEVTEDG_SHIFT		8
#define TC1_CMR1_WAVE_EQ_1_EEVTEDG_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_eevtedg EEVTEDG
* @brief External Event Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_CPCDIS
* @brief Counter Clock Disable with RC Compare */
#define TC1_CMR1_WAVE_EQ_1_CPCDIS		(1 << 7)

/* @def TC1_CMR1_WAVE_EQ_1_CPCSTOP
* @brief Counter Clock Stopped with RC Compare */
#define TC1_CMR1_WAVE_EQ_1_CPCSTOP		(1 << 6)

/* @def TC1_CMR1_WAVE_EQ_1_BURST
* @brief Burst Signal Selection */
#define TC1_CMR1_WAVE_EQ_1_BURST_SHIFT		4
#define TC1_CMR1_WAVE_EQ_1_BURST_MASK		0x03
/** @defgroup tc1_cmr1_wave_eq_1_burst BURST
* @brief Burst Signal Selection
@{*/
/*@}*/

/* @def TC1_CMR1_WAVE_EQ_1_CLKI
* @brief Clock Invert */
#define TC1_CMR1_WAVE_EQ_1_CLKI		(1 << 3)

/* @def TC1_CMR1_WAVE_EQ_1_TCCLKS
* @brief Clock Selection */
#define TC1_CMR1_WAVE_EQ_1_TCCLKS_SHIFT		0
#define TC1_CMR1_WAVE_EQ_1_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr1_wave_eq_1_tcclks TCCLKS
* @brief Clock Selection
@{*/
/*@}*/

/* --- TC1_SMMR1 values --------------------------------------------- */


/* @def TC1_SMMR1_DOWN
* @brief DOWN Count */
#define TC1_SMMR1_DOWN		(1 << 1)

/* @def TC1_SMMR1_GCEN
* @brief Gray Count Enable */
#define TC1_SMMR1_GCEN		(1 << 0)

/* --- TC1_CV1 values ----------------------------------------------- */


