grevaillot/svd_tools/headers/ATSAM4S16B/tc1.h
/* @def TC1_CV1_CV
* @brief Counter Value */
#define TC1_CV1_CV_SHIFT		0
#define TC1_CV1_CV_MASK		0xffffffff
/** @defgroup tc1_cv1_cv CV
* @brief Counter Value
@{*/
/*@}*/

/* --- TC1_RA1 values ----------------------------------------------- */


/* @def TC1_RA1_RA
* @brief Register A */
#define TC1_RA1_RA_SHIFT		0
#define TC1_RA1_RA_MASK		0xffffffff
/** @defgroup tc1_ra1_ra RA
* @brief Register A
@{*/
/*@}*/

/* --- TC1_RB1 values ----------------------------------------------- */


/* @def TC1_RB1_RB
* @brief Register B */
#define TC1_RB1_RB_SHIFT		0
#define TC1_RB1_RB_MASK		0xffffffff
/** @defgroup tc1_rb1_rb RB
* @brief Register B
@{*/
/*@}*/

/* --- TC1_RC1 values ----------------------------------------------- */


/* @def TC1_RC1_RC
* @brief Register C */
#define TC1_RC1_RC_SHIFT		0
#define TC1_RC1_RC_MASK		0xffffffff
/** @defgroup tc1_rc1_rc RC
* @brief Register C
@{*/
/*@}*/

/* --- TC1_SR1 values ----------------------------------------------- */


/* @def TC1_SR1_MTIOB
* @brief TIOB Mirror */
#define TC1_SR1_MTIOB		(1 << 18)

/* @def TC1_SR1_MTIOA
* @brief TIOA Mirror */
#define TC1_SR1_MTIOA		(1 << 17)

/* @def TC1_SR1_CLKSTA
* @brief Clock Enabling Status */
#define TC1_SR1_CLKSTA		(1 << 16)

/* @def TC1_SR1_ETRGS
* @brief External Trigger Status */
#define TC1_SR1_ETRGS		(1 << 7)

/* @def TC1_SR1_LDRBS
* @brief RB Loading Status */
#define TC1_SR1_LDRBS		(1 << 6)

/* @def TC1_SR1_LDRAS
* @brief RA Loading Status */
#define TC1_SR1_LDRAS		(1 << 5)

/* @def TC1_SR1_CPCS
* @brief RC Compare Status */
#define TC1_SR1_CPCS		(1 << 4)

/* @def TC1_SR1_CPBS
* @brief RB Compare Status */
#define TC1_SR1_CPBS		(1 << 3)

/* @def TC1_SR1_CPAS
* @brief RA Compare Status */
#define TC1_SR1_CPAS		(1 << 2)

/* @def TC1_SR1_LOVRS
* @brief Load Overrun Status */
#define TC1_SR1_LOVRS		(1 << 1)

/* @def TC1_SR1_COVFS
* @brief Counter Overflow Status */
#define TC1_SR1_COVFS		(1 << 0)

/* --- TC1_IER1 values ---------------------------------------------- */


/* @def TC1_IER1_ETRGS
* @brief External Trigger */
#define TC1_IER1_ETRGS		(1 << 7)

/* @def TC1_IER1_LDRBS
* @brief RB Loading */
#define TC1_IER1_LDRBS		(1 << 6)

/* @def TC1_IER1_LDRAS
* @brief RA Loading */
#define TC1_IER1_LDRAS		(1 << 5)

/* @def TC1_IER1_CPCS
* @brief RC Compare */
#define TC1_IER1_CPCS		(1 << 4)

/* @def TC1_IER1_CPBS
* @brief RB Compare */
#define TC1_IER1_CPBS		(1 << 3)

/* @def TC1_IER1_CPAS
* @brief RA Compare */
#define TC1_IER1_CPAS		(1 << 2)

/* @def TC1_IER1_LOVRS
* @brief Load Overrun */
#define TC1_IER1_LOVRS		(1 << 1)

/* @def TC1_IER1_COVFS
* @brief Counter Overflow */
#define TC1_IER1_COVFS		(1 << 0)

/* --- TC1_IDR1 values ---------------------------------------------- */


/* @def TC1_IDR1_ETRGS
* @brief External Trigger */
#define TC1_IDR1_ETRGS		(1 << 7)

/* @def TC1_IDR1_LDRBS
* @brief RB Loading */
#define TC1_IDR1_LDRBS		(1 << 6)

/* @def TC1_IDR1_LDRAS
* @brief RA Loading */
#define TC1_IDR1_LDRAS		(1 << 5)

/* @def TC1_IDR1_CPCS
* @brief RC Compare */
#define TC1_IDR1_CPCS		(1 << 4)

/* @def TC1_IDR1_CPBS
* @brief RB Compare */
#define TC1_IDR1_CPBS		(1 << 3)

/* @def TC1_IDR1_CPAS
* @brief RA Compare */
#define TC1_IDR1_CPAS		(1 << 2)

/* @def TC1_IDR1_LOVRS
* @brief Load Overrun */
#define TC1_IDR1_LOVRS		(1 << 1)

/* @def TC1_IDR1_COVFS
* @brief Counter Overflow */
#define TC1_IDR1_COVFS		(1 << 0)

/* --- TC1_IMR1 values ---------------------------------------------- */


/* @def TC1_IMR1_ETRGS
* @brief External Trigger */
#define TC1_IMR1_ETRGS		(1 << 7)

/* @def TC1_IMR1_LDRBS
* @brief RB Loading */
#define TC1_IMR1_LDRBS		(1 << 6)

/* @def TC1_IMR1_LDRAS
* @brief RA Loading */
#define TC1_IMR1_LDRAS		(1 << 5)

/* @def TC1_IMR1_CPCS
* @brief RC Compare */
#define TC1_IMR1_CPCS		(1 << 4)

/* @def TC1_IMR1_CPBS
* @brief RB Compare */
#define TC1_IMR1_CPBS		(1 << 3)

/* @def TC1_IMR1_CPAS
* @brief RA Compare */
#define TC1_IMR1_CPAS		(1 << 2)

/* @def TC1_IMR1_LOVRS
* @brief Load Overrun */
#define TC1_IMR1_LOVRS		(1 << 1)

/* @def TC1_IMR1_COVFS
* @brief Counter Overflow */
#define TC1_IMR1_COVFS		(1 << 0)

/* --- TC1_CCR2 values ---------------------------------------------- */


/* @def TC1_CCR2_SWTRG
* @brief Software Trigger Command */
#define TC1_CCR2_SWTRG		(1 << 2)

/* @def TC1_CCR2_CLKDIS
* @brief Counter Clock Disable Command */
#define TC1_CCR2_CLKDIS		(1 << 1)

/* @def TC1_CCR2_CLKEN
* @brief Counter Clock Enable Command */
#define TC1_CCR2_CLKEN		(1 << 0)

/* --- TC1_CMR2 values ---------------------------------------------- */


/* @def TC1_CMR2_LDRB
* @brief RB Loading Edge Selection */
#define TC1_CMR2_LDRB_SHIFT		18
#define TC1_CMR2_LDRB_MASK		0x03
/** @defgroup tc1_cmr2_ldrb LDRB
* @brief RB Loading Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR2_LDRA
* @brief RA Loading Edge Selection */
#define TC1_CMR2_LDRA_SHIFT		16
#define TC1_CMR2_LDRA_MASK		0x03
/** @defgroup tc1_cmr2_ldra LDRA
* @brief RA Loading Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE
* @brief Waveform Mode */
#define TC1_CMR2_WAVE		(1 << 15)

/* @def TC1_CMR2_CPCTRG
* @brief RC Compare Trigger Enable */
#define TC1_CMR2_CPCTRG		(1 << 14)

/* @def TC1_CMR2_ABETRG
* @brief TIOA or TIOB External Trigger Selection */
#define TC1_CMR2_ABETRG		(1 << 10)

/* @def TC1_CMR2_ETRGEDG
* @brief External Trigger Edge Selection */
#define TC1_CMR2_ETRGEDG_SHIFT		8
#define TC1_CMR2_ETRGEDG_MASK		0x03
/** @defgroup tc1_cmr2_etrgedg ETRGEDG
* @brief External Trigger Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR2_LDBDIS
* @brief Counter Clock Disable with RB Loading */
#define TC1_CMR2_LDBDIS		(1 << 7)

/* @def TC1_CMR2_LDBSTOP
* @brief Counter Clock Stopped with RB Loading */
#define TC1_CMR2_LDBSTOP		(1 << 6)

/* @def TC1_CMR2_BURST
* @brief Burst Signal Selection */
#define TC1_CMR2_BURST_SHIFT		4
#define TC1_CMR2_BURST_MASK		0x03
/** @defgroup tc1_cmr2_burst BURST
* @brief Burst Signal Selection
@{*/
/*@}*/

/* @def TC1_CMR2_CLKI
* @brief Clock Invert */
#define TC1_CMR2_CLKI		(1 << 3)

/* @def TC1_CMR2_TCCLKS
* @brief Clock Selection */
#define TC1_CMR2_TCCLKS_SHIFT		0
#define TC1_CMR2_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr2_tcclks TCCLKS
* @brief Clock Selection
@{*/
/*@}*/

/* --- TC1_CMR2_WAVE_EQ_1 values ------------------------------------ */


/* @def TC1_CMR2_WAVE_EQ_1_BSWTRG
* @brief Software Trigger Effect on TIOB */
#define TC1_CMR2_WAVE_EQ_1_BSWTRG_SHIFT		30
#define TC1_CMR2_WAVE_EQ_1_BSWTRG_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_bswtrg BSWTRG
* @brief Software Trigger Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_BEEVT
* @brief External Event Effect on TIOB */
#define TC1_CMR2_WAVE_EQ_1_BEEVT_SHIFT		28
#define TC1_CMR2_WAVE_EQ_1_BEEVT_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_beevt BEEVT
* @brief External Event Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_BCPC
* @brief RC Compare Effect on TIOB */
#define TC1_CMR2_WAVE_EQ_1_BCPC_SHIFT		26
#define TC1_CMR2_WAVE_EQ_1_BCPC_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_bcpc BCPC
* @brief RC Compare Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_BCPB
* @brief RB Compare Effect on TIOB */
#define TC1_CMR2_WAVE_EQ_1_BCPB_SHIFT		24
#define TC1_CMR2_WAVE_EQ_1_BCPB_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_bcpb BCPB
* @brief RB Compare Effect on TIOB
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_ASWTRG
* @brief Software Trigger Effect on TIOA */
#define TC1_CMR2_WAVE_EQ_1_ASWTRG_SHIFT		22
#define TC1_CMR2_WAVE_EQ_1_ASWTRG_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_aswtrg ASWTRG
* @brief Software Trigger Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_AEEVT
* @brief External Event Effect on TIOA */
#define TC1_CMR2_WAVE_EQ_1_AEEVT_SHIFT		20
#define TC1_CMR2_WAVE_EQ_1_AEEVT_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_aeevt AEEVT
* @brief External Event Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_ACPC
* @brief RC Compare Effect on TIOA */
#define TC1_CMR2_WAVE_EQ_1_ACPC_SHIFT		18
#define TC1_CMR2_WAVE_EQ_1_ACPC_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_acpc ACPC
* @brief RC Compare Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_ACPA
* @brief RA Compare Effect on TIOA */
#define TC1_CMR2_WAVE_EQ_1_ACPA_SHIFT		16
#define TC1_CMR2_WAVE_EQ_1_ACPA_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_acpa ACPA
* @brief RA Compare Effect on TIOA
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_WAVE
* @brief Waveform Mode */
#define TC1_CMR2_WAVE_EQ_1_WAVE		(1 << 15)

/* @def TC1_CMR2_WAVE_EQ_1_WAVSEL
* @brief Waveform Selection */
#define TC1_CMR2_WAVE_EQ_1_WAVSEL_SHIFT		13
#define TC1_CMR2_WAVE_EQ_1_WAVSEL_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_wavsel WAVSEL
* @brief Waveform Selection
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_ENETRG
* @brief External Event Trigger Enable */
#define TC1_CMR2_WAVE_EQ_1_ENETRG		(1 << 12)

/* @def TC1_CMR2_WAVE_EQ_1_EEVT
* @brief External Event Selection */
#define TC1_CMR2_WAVE_EQ_1_EEVT_SHIFT		10
#define TC1_CMR2_WAVE_EQ_1_EEVT_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_eevt EEVT
* @brief External Event Selection
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_EEVTEDG
* @brief External Event Edge Selection */
#define TC1_CMR2_WAVE_EQ_1_EEVTEDG_SHIFT		8
#define TC1_CMR2_WAVE_EQ_1_EEVTEDG_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_eevtedg EEVTEDG
* @brief External Event Edge Selection
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_CPCDIS
* @brief Counter Clock Disable with RC Compare */
#define TC1_CMR2_WAVE_EQ_1_CPCDIS		(1 << 7)

