grevaillot/svd_tools/headers/ATSAM4S16B/tc1.h
/* @def TC1_CMR2_WAVE_EQ_1_CPCSTOP
* @brief Counter Clock Stopped with RC Compare */
#define TC1_CMR2_WAVE_EQ_1_CPCSTOP		(1 << 6)

/* @def TC1_CMR2_WAVE_EQ_1_BURST
* @brief Burst Signal Selection */
#define TC1_CMR2_WAVE_EQ_1_BURST_SHIFT		4
#define TC1_CMR2_WAVE_EQ_1_BURST_MASK		0x03
/** @defgroup tc1_cmr2_wave_eq_1_burst BURST
* @brief Burst Signal Selection
@{*/
/*@}*/

/* @def TC1_CMR2_WAVE_EQ_1_CLKI
* @brief Clock Invert */
#define TC1_CMR2_WAVE_EQ_1_CLKI		(1 << 3)

/* @def TC1_CMR2_WAVE_EQ_1_TCCLKS
* @brief Clock Selection */
#define TC1_CMR2_WAVE_EQ_1_TCCLKS_SHIFT		0
#define TC1_CMR2_WAVE_EQ_1_TCCLKS_MASK		0x07
/** @defgroup tc1_cmr2_wave_eq_1_tcclks TCCLKS
* @brief Clock Selection
@{*/
/*@}*/

/* --- TC1_SMMR2 values --------------------------------------------- */


/* @def TC1_SMMR2_DOWN
* @brief DOWN Count */
#define TC1_SMMR2_DOWN		(1 << 1)

/* @def TC1_SMMR2_GCEN
* @brief Gray Count Enable */
#define TC1_SMMR2_GCEN		(1 << 0)

/* --- TC1_CV2 values ----------------------------------------------- */


/* @def TC1_CV2_CV
* @brief Counter Value */
#define TC1_CV2_CV_SHIFT		0
#define TC1_CV2_CV_MASK		0xffffffff
/** @defgroup tc1_cv2_cv CV
* @brief Counter Value
@{*/
/*@}*/

/* --- TC1_RA2 values ----------------------------------------------- */


/* @def TC1_RA2_RA
* @brief Register A */
#define TC1_RA2_RA_SHIFT		0
#define TC1_RA2_RA_MASK		0xffffffff
/** @defgroup tc1_ra2_ra RA
* @brief Register A
@{*/
/*@}*/

/* --- TC1_RB2 values ----------------------------------------------- */


/* @def TC1_RB2_RB
* @brief Register B */
#define TC1_RB2_RB_SHIFT		0
#define TC1_RB2_RB_MASK		0xffffffff
/** @defgroup tc1_rb2_rb RB
* @brief Register B
@{*/
/*@}*/

/* --- TC1_RC2 values ----------------------------------------------- */


/* @def TC1_RC2_RC
* @brief Register C */
#define TC1_RC2_RC_SHIFT		0
#define TC1_RC2_RC_MASK		0xffffffff
/** @defgroup tc1_rc2_rc RC
* @brief Register C
@{*/
/*@}*/

/* --- TC1_SR2 values ----------------------------------------------- */


/* @def TC1_SR2_MTIOB
* @brief TIOB Mirror */
#define TC1_SR2_MTIOB		(1 << 18)

/* @def TC1_SR2_MTIOA
* @brief TIOA Mirror */
#define TC1_SR2_MTIOA		(1 << 17)

/* @def TC1_SR2_CLKSTA
* @brief Clock Enabling Status */
#define TC1_SR2_CLKSTA		(1 << 16)

/* @def TC1_SR2_ETRGS
* @brief External Trigger Status */
#define TC1_SR2_ETRGS		(1 << 7)

/* @def TC1_SR2_LDRBS
* @brief RB Loading Status */
#define TC1_SR2_LDRBS		(1 << 6)

/* @def TC1_SR2_LDRAS
* @brief RA Loading Status */
#define TC1_SR2_LDRAS		(1 << 5)

/* @def TC1_SR2_CPCS
* @brief RC Compare Status */
#define TC1_SR2_CPCS		(1 << 4)

/* @def TC1_SR2_CPBS
* @brief RB Compare Status */
#define TC1_SR2_CPBS		(1 << 3)

/* @def TC1_SR2_CPAS
* @brief RA Compare Status */
#define TC1_SR2_CPAS		(1 << 2)

/* @def TC1_SR2_LOVRS
* @brief Load Overrun Status */
#define TC1_SR2_LOVRS		(1 << 1)

/* @def TC1_SR2_COVFS
* @brief Counter Overflow Status */
#define TC1_SR2_COVFS		(1 << 0)

/* --- TC1_IER2 values ---------------------------------------------- */


/* @def TC1_IER2_ETRGS
* @brief External Trigger */
#define TC1_IER2_ETRGS		(1 << 7)

/* @def TC1_IER2_LDRBS
* @brief RB Loading */
#define TC1_IER2_LDRBS		(1 << 6)

/* @def TC1_IER2_LDRAS
* @brief RA Loading */
#define TC1_IER2_LDRAS		(1 << 5)

/* @def TC1_IER2_CPCS
* @brief RC Compare */
#define TC1_IER2_CPCS		(1 << 4)

/* @def TC1_IER2_CPBS
* @brief RB Compare */
#define TC1_IER2_CPBS		(1 << 3)

/* @def TC1_IER2_CPAS
* @brief RA Compare */
#define TC1_IER2_CPAS		(1 << 2)

/* @def TC1_IER2_LOVRS
* @brief Load Overrun */
#define TC1_IER2_LOVRS		(1 << 1)

/* @def TC1_IER2_COVFS
* @brief Counter Overflow */
#define TC1_IER2_COVFS		(1 << 0)

/* --- TC1_IDR2 values ---------------------------------------------- */


/* @def TC1_IDR2_ETRGS
* @brief External Trigger */
#define TC1_IDR2_ETRGS		(1 << 7)

/* @def TC1_IDR2_LDRBS
* @brief RB Loading */
#define TC1_IDR2_LDRBS		(1 << 6)

/* @def TC1_IDR2_LDRAS
* @brief RA Loading */
#define TC1_IDR2_LDRAS		(1 << 5)

/* @def TC1_IDR2_CPCS
* @brief RC Compare */
#define TC1_IDR2_CPCS		(1 << 4)

/* @def TC1_IDR2_CPBS
* @brief RB Compare */
#define TC1_IDR2_CPBS		(1 << 3)

/* @def TC1_IDR2_CPAS
* @brief RA Compare */
#define TC1_IDR2_CPAS		(1 << 2)

/* @def TC1_IDR2_LOVRS
* @brief Load Overrun */
#define TC1_IDR2_LOVRS		(1 << 1)

/* @def TC1_IDR2_COVFS
* @brief Counter Overflow */
#define TC1_IDR2_COVFS		(1 << 0)

/* --- TC1_IMR2 values ---------------------------------------------- */


/* @def TC1_IMR2_ETRGS
* @brief External Trigger */
#define TC1_IMR2_ETRGS		(1 << 7)

/* @def TC1_IMR2_LDRBS
* @brief RB Loading */
#define TC1_IMR2_LDRBS		(1 << 6)

/* @def TC1_IMR2_LDRAS
* @brief RA Loading */
#define TC1_IMR2_LDRAS		(1 << 5)

/* @def TC1_IMR2_CPCS
* @brief RC Compare */
#define TC1_IMR2_CPCS		(1 << 4)

/* @def TC1_IMR2_CPBS
* @brief RB Compare */
#define TC1_IMR2_CPBS		(1 << 3)

/* @def TC1_IMR2_CPAS
* @brief RA Compare */
#define TC1_IMR2_CPAS		(1 << 2)

/* @def TC1_IMR2_LOVRS
* @brief Load Overrun */
#define TC1_IMR2_LOVRS		(1 << 1)

/* @def TC1_IMR2_COVFS
* @brief Counter Overflow */
#define TC1_IMR2_COVFS		(1 << 0)

/* --- TC1_BCR values ----------------------------------------------- */


/* @def TC1_BCR_SYNC
* @brief Synchro Command */
#define TC1_BCR_SYNC		(1 << 0)

/* --- TC1_BMR values ----------------------------------------------- */


/* @def TC1_BMR_MAXFILT
* @brief MAXimum FILTer */
#define TC1_BMR_MAXFILT_SHIFT		20
#define TC1_BMR_MAXFILT_MASK		0x3f
/** @defgroup tc1_bmr_maxfilt MAXFILT
* @brief MAXimum FILTer
@{*/
/*@}*/

/* @def TC1_BMR_FILTER
* @brief  */
#define TC1_BMR_FILTER		(1 << 19)

/* @def TC1_BMR_IDXPHB
* @brief InDeX pin is PHB pin */
#define TC1_BMR_IDXPHB		(1 << 17)

/* @def TC1_BMR_SWAP
* @brief SWAP PHA and PHB */
#define TC1_BMR_SWAP		(1 << 16)

/* @def TC1_BMR_INVIDX
* @brief INVerted InDeX */
#define TC1_BMR_INVIDX		(1 << 15)

/* @def TC1_BMR_INVB
* @brief INVerted phB */
#define TC1_BMR_INVB		(1 << 14)

/* @def TC1_BMR_INVA
* @brief INVerted phA */
#define TC1_BMR_INVA		(1 << 13)

/* @def TC1_BMR_EDGPHA
* @brief EDGe on PHA count mode */
#define TC1_BMR_EDGPHA		(1 << 12)

/* @def TC1_BMR_QDTRANS
* @brief Quadrature Decoding TRANSparent */
#define TC1_BMR_QDTRANS		(1 << 11)

/* @def TC1_BMR_SPEEDEN
* @brief SPEED ENabled */
#define TC1_BMR_SPEEDEN		(1 << 10)

