grevaillot/svd_tools/headers/ATSAM4S16B/tc1.h
/* @def TC1_BMR_POSEN
* @brief POSition ENabled */
#define TC1_BMR_POSEN		(1 << 9)

/* @def TC1_BMR_QDEN
* @brief Quadrature Decoder ENabled */
#define TC1_BMR_QDEN		(1 << 8)

/* @def TC1_BMR_TC2XC2S
* @brief External Clock Signal 2 Selection */
#define TC1_BMR_TC2XC2S_SHIFT		4
#define TC1_BMR_TC2XC2S_MASK		0x03
/** @defgroup tc1_bmr_tc2xc2s TC2XC2S
* @brief External Clock Signal 2 Selection
@{*/
/*@}*/

/* @def TC1_BMR_TC1XC1S
* @brief External Clock Signal 1 Selection */
#define TC1_BMR_TC1XC1S_SHIFT		2
#define TC1_BMR_TC1XC1S_MASK		0x03
/** @defgroup tc1_bmr_tc1xc1s TC1XC1S
* @brief External Clock Signal 1 Selection
@{*/
/*@}*/

/* @def TC1_BMR_TC0XC0S
* @brief External Clock Signal 0 Selection */
#define TC1_BMR_TC0XC0S_SHIFT		0
#define TC1_BMR_TC0XC0S_MASK		0x03
/** @defgroup tc1_bmr_tc0xc0s TC0XC0S
* @brief External Clock Signal 0 Selection
@{*/
/*@}*/

/* --- TC1_QIER values ---------------------------------------------- */


/* @def TC1_QIER_QERR
* @brief Quadrature ERRor */
#define TC1_QIER_QERR		(1 << 2)

/* @def TC1_QIER_DIRCHG
* @brief DIRection CHanGe */
#define TC1_QIER_DIRCHG		(1 << 1)

/* @def TC1_QIER_IDX
* @brief InDeX */
#define TC1_QIER_IDX		(1 << 0)

/* --- TC1_QIDR values ---------------------------------------------- */


/* @def TC1_QIDR_QERR
* @brief Quadrature ERRor */
#define TC1_QIDR_QERR		(1 << 2)

/* @def TC1_QIDR_DIRCHG
* @brief DIRection CHanGe */
#define TC1_QIDR_DIRCHG		(1 << 1)

/* @def TC1_QIDR_IDX
* @brief InDeX */
#define TC1_QIDR_IDX		(1 << 0)

/* --- TC1_QIMR values ---------------------------------------------- */


/* @def TC1_QIMR_QERR
* @brief Quadrature ERRor */
#define TC1_QIMR_QERR		(1 << 2)

/* @def TC1_QIMR_DIRCHG
* @brief DIRection CHanGe */
#define TC1_QIMR_DIRCHG		(1 << 1)

/* @def TC1_QIMR_IDX
* @brief InDeX */
#define TC1_QIMR_IDX		(1 << 0)

/* --- TC1_QISR values ---------------------------------------------- */


/* @def TC1_QISR_DIR
* @brief DIRection */
#define TC1_QISR_DIR		(1 << 8)

/* @def TC1_QISR_QERR
* @brief Quadrature ERRor */
#define TC1_QISR_QERR		(1 << 2)

/* @def TC1_QISR_DIRCHG
* @brief DIRection CHanGe */
#define TC1_QISR_DIRCHG		(1 << 1)

/* @def TC1_QISR_IDX
* @brief InDeX */
#define TC1_QISR_IDX		(1 << 0)

/* --- TC1_FMR values ----------------------------------------------- */


/* @def TC1_FMR_ENCF1
* @brief ENable Compare Fault Channel 1 */
#define TC1_FMR_ENCF1		(1 << 1)

/* @def TC1_FMR_ENCF0
* @brief ENable Compare Fault Channel 0 */
#define TC1_FMR_ENCF0		(1 << 0)

/* --- TC1_WPMR values ---------------------------------------------- */


/* @def TC1_WPMR_WPKEY
* @brief Write Protect KEY */
#define TC1_WPMR_WPKEY_SHIFT		8
#define TC1_WPMR_WPKEY_MASK		0xffffff
/** @defgroup tc1_wpmr_wpkey WPKEY
* @brief Write Protect KEY
@{*/
/*@}*/

/* @def TC1_WPMR_WPEN
* @brief Write Protect Enable */
#define TC1_WPMR_WPEN		(1 << 0)
